[
  {
    "id": "mmm-ecommerce-bayesian",
    "title": {
      "en": "Marketing Mix Modeling: eCommerce ROI",
      "pt": "Marketing Mix Modeling: ROI eCommerce"
    },
    "description": {
      "en": "Bayesian Media Mix Model to quantify ROI of digital advertising (Google, Meta, TikTok) and optimize budget allocation across 18 territories with uncertainty quantification.",
      "pt": "Modelo Bayesiano de Mix de Mídia para quantificar ROI de publicidade digital (Google, Meta, TikTok) e otimizar alocação de budget em 18 territórios com quantificação de incerteza."
    },
    "image": "assets/img/projects/mmm_thumbnail.webp",
    "alt": {
      "en": "Marketing Mix Modeling dashboard showing channel ROI analysis with saturation curves and budget optimization interface",
      "pt": "Dashboard de Marketing Mix Modeling mostrando análise de ROI por canal com curvas de saturação e interface de otimização de budget"
    },
    "technologies": [
      "Python",
      "PyMC-Marketing",
      "PyMC",
      "ArviZ",
      "MLflow",
      "Streamlit",
      "Pandas"
    ],
    "link": "projects/mmm-ecommerce.html"
  },
  {
    "id": "two-tower-recommendation-mlops",
    "title": {
      "en": "H&M Two-Stage Recommender System",
      "pt": "Sistema de Recomendação H&M (2 Estágios)"
    },
    "description": {
      "en": "Large-scale recommendation system for H&M (144B search space). Implements a Two-Stage Funnel (Retrieval + Ranking) to optimize MAP@12 while maintaining 100ms latency limits.",
      "pt": "Sistema de recomendação em larga escala para H&M (espaço de 144B). Implementa um Funil de 2 Estágios (Retrieval + Ranking) para otimizar MAP@12 mantendo latência de 100ms."
    },
    "image": "assets/img/projects/2tower_img_mini.webp",
    "alt": {
      "en": "Two-Tower Recommendation Architecture: dual neural network towers (Query Tower for users and Candidate Tower for items) connected through a shared embedding space for efficient similarity matching",
      "pt": "Arquitetura de Recomendação Two-Tower: torres de rede neural duplas (Torre de Consulta para usuários e Torre de Candidatos para itens) conectadas através de um espaço de embeddings compartilhado para correspondência eficiente de similaridade"
    },
    "technologies": [
      "Python",
      "TensorFlow",
      "Optuna",
      "CatBoost",
      "MLflow",
      "Scikit-learn",
      "Pandas",
      "NumPy",
      "TensorFlow Recommenders"
    ],
    "link": "projects/two-tower-recommendation.html"
  }
]
